Revit 2026 API

# DocumentSynchronizingWithCentralEventArgs Class

---

The event arguments used by the DocumentSynchronizingWithCentralEventArgs event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.DB.EventsRevitAPIPreDocEventArgs Autodesk.Revit.DB.EventsDocumentSynchronizingWithCentralEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DocumentSynchronizingWithCentralEventArgs : RevitAPIPreDocEventArgs
```
```vb
Public Class DocumentSynchronizingWithCentralEventArgs
	Inherits RevitAPIPreDocEventArgs
```
```cpp
public ref class DocumentSynchronizingWithCentralEventArgs : public RevitAPIPreDocEventArgs
```
```fsharp
type DocumentSynchronizingWithCentralEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
```

The DocumentSynchronizingWithCentralEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Comments | User's comments for synchronization. |
|  | Document | The document associated with the event. (Inherited from RevitAPIPreDocEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Location | Full path of the central model which is to be synchronized. |
|  | Options | User's options associated with the synchronization operation. |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace